import {IROUTES} from "@/types";

export const GROUP_BUTTON_HEADER: IROUTES[] = [
    {title: 'Позвонить', href: '+375 33 693 3428', classPrefix: 'btn-1'},
    {title: 'Записаться Онлайн', href: '', classPrefix: 'btn-2'},
]

export const LIST_DESCRIPTIONS: { label: string }[] = [
    {label: 'Дипломированый мастер по скоростному  наращиванию ресниц '},
    {label: 'Наша территория красоты создавалась с любовью и заботой о вас! '},
    {label: 'Я знаю, как трепетно каждая девушка относится к своей внешности, как важно , найти мастера, который оправдает все ваши ожидания, совместно с командой профессионалов "BOG OKO", мы воплотили в жизнь пространство с уникальными людьми, любящими свою профессию, готовыми всецело отдаваться и дарить красоту и заботу каждому гостю. '},
    {label: 'На нашей территории вы не будете чувствовать себя гостем,потому как, у нам  уютно как дома, душевно и комфортно, мы открыты и влюблены в свое дело, мы не любим строгие правила, наш сервис это доброта и искреннее внимание, нас не нужно заставлять улыбаться, мы делаем то сами, от души и с огромной благодарностью относимся к каждому человеку оказавшемуся на нашем пороге!'},
]

export const ITEM_POINTS: { label: string, list: string[] }[] =
    [
        {
            label: 'salonFourOrSix',
            list: [
                'Ресницы+маникюр+педикюр',
                'Уход за бровями+маникюр+педикюр',
                'Косметолог+маникюр+педикюр',
                'Косметолог+маникюр+депиляции ног'
            ]
        },
        {
            label: 'salonManicure',
            list: [
                'Маникюр мужской,женский',
                'Педикюр мужской,женский',
                'Покрытие гель лак',
                'Наращивание ногтей',
                'Дизайн'
            ]
        },
        {
            label: 'salonEyes',
            list: [
                '1d',
                '2d',
                '3d',
                '4d',
                '5d+',
                'Экспресс',
                'Снятие нарощенных ресниц',
                'Цветной дизайн',
                'Свадебный',
                'Вечерний',
                'Дневной',
                'Окрашивание',
                'Коррекция',
                'Ламинирование бровей',
            ]
        },
        {
            label: 'salonHeir',
            list: [
                'Стрижка (женская,мужская,детская)',
                'Кератиновое выпрямление',
                'Ботокс для волос',
                'Экранирование',
                'Лечение волос',
                'Окрашивания',
                'Афрокосы,зи-зи,сенегальские косы и др.'
            ]
        },
        {
            label: 'salonMassage',
            list: [
                'Спортивный',
                'Расслабляющий',
                'Лечебный',
                'Антицеллюлитный',
                'Вибрационный',
                'Вакуумно-баночный',
                'Лимфодренажный',
                'Массаж лица',
            ]
        },
        {
            label: 'salonPermanent',
            list: [
                'Перманентный макияж губ',
                'Перманентный макияж бровей',
                'Межресничная стрелка',
            ]
        },
        {
            label: 'salonCosmetologist',
            list: [
                'Пилинги',
                'Чистка лица',
                'Массаж',
                'Карбоксерапия',
                'Уходовые процедуры',
            ]
        },
        {
            label: 'salonDepilation',
            list: [
                'Мужская дептляция',
                'Женская депиляция',
            ]
        },
    ]


export const ITEM_POINTS_ONE_DESC: { label: string, desc: string; icon: string }[] = [
    {
        label: 'ПРОФЕССИОНАЛЬНАЯ КОМАНДА',
        desc: 'Вы доверяете нам самое ценное ваше здоровье и красоты. Можете быть уверены, они в надежных руках. Наши врачи-косметологи имеютнеобходимое образование подтвержденное дипломом. ',
        icon: ''
    },
    {
        label: 'ПРОФЕССИОНАЛЬНАЯ КОМАНДА',
        desc: 'Вы доверяете нам самое ценное ваше здоровье и красоты. Можете быть уверены, они в надежных руках. Наши врачи-косметологи имеютнеобходимое образование подтвержденное дипломом. ',
        icon: ''
    },
]